tsung/qida.dv.from.response.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" dumptraffic="true" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="5000" />
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="api.qida.yunxuetang.cn" port="80" type="tcp"></server>
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 

  <monitoring>
    <monitor host="10.10.177.221" type="snmp">
      <snmp version="v2" community="oe5Q8FAu" port="161"/>
    </monitor>

    <monitor host="10.10.198.61" type="snmp">
      <snmp version="v2" community="oe5Q8FAu" port="161"/>
    </monitor>

    <monitor host="10.10.24.115" type="snmp">
      <snmp version="v2" community="oe5Q8FAu" port="161"/>
    </monitor>    
  </monitoring>

  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="1" unit="minute">
     <users arrivalrate="10" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
   <option name="file_server" id="userlist" value="/opt/tsung/userlist.csv"></option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-login" probability="100" type="ts_http">
    <setdynvars sourcetype="file" fileid="userlist" delimiter="," order="iter">
      <var name="username" />
      <var name="password" />
    </setdynvars>   

    <!-- full url with server name, this overrides the "server" config value -->
    <!-- "token": "AAAAABip4CKdeMmVg1tAGyFhHxkGfQjR_fYIV23J40pyt6K2AclDggQEcy4li2KeqmHI16xcuwUAFEBpZxs12Rd9RfAg1xzr9s93k1BdpMcK3BJGDJmzGuAC9zi73vjicAaRbMTeaZ8PquhNsCUM-xi2uuQ", -->
    <request subst="true">
      <!-- <dyn_variable name="tt" jsonpath="token.value"/> -->
      <dyn_variable name="dva" re="&quot;token&quot;:&quot;([\w-]+)&quot;"/>
      <dyn_variable name="token" jsonpath ="$.token"/>
      <dyn_variable name="orgId" jsonpath ="$.orgId"/>
      <dyn_variable name="userId" jsonpath ="$.userId"/>

      <http 
        url="http://api.qida.yunxuetang.cn/v1/users/tokens" 
        method="POST" 
        version="1.1"
        content_type="application/json" 
        contents="{&quot;deviceId&quot;: &quot;&quot;,&quot;domainName&quot;: &quot;hz.yunxuetang.cn&quot;,&quot;isCheck&quot;: 1,&quot;password&quot;: &quot;JtwmY8.15&quot;,&quot;userName&quot;: &quot;lile&quot;}">
    
      </http>      
    </request>
    <!--
    <request> <http url="/images/accueil1.gif" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
    <request> <http url="/images/accueil2.gif" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
    <request> <http url="/images/accueil3.gif" method="GET" version="1.1" if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT"></http> </request>
    -->

    <thinktime value="0.1" random="true"></thinktime>
    <request subst="true">
      <http 
        url="http://api.qida.yunxuetang.cn/v1/study" 
        method="POST" 
        version="1.1"
        content_type="application/json" 
        contents="{&quot;KnowledgeID&quot;: &quot;11c41991-7874-475d-bd33-bc3b8565ecc1&quot;,&quot;MasterType&quot;: &quot;&quot;,&quot;StudyTime&quot;: &quot;120&quot;,&quot;Type&quot;: &quot;1&quot;,&quot;OrgID&quot;: &quot;%%_orgId%%&quot;,&quot;UserID&quot;: &quot;%%_userId%%&quot;}">
        <http_header name="token" value="%%_token%%"/>
    
      </http>      
    </request>   
  </session>
 </sessions>
</tsung>